    var myChart = echarts.init(document.getElementById('2'));
    var option = {
    title:{
        text:'图10 2010年城市流动人口按年龄分女性比例',
        textStyle: {
            color:'#FFF',
        },
        left: 0,
        top: 0
} ,
    tooltip: {
    show: 'true',
    trigger: "axis"
},
    grid:{
    left: '5%',
    right: '12%',
    bottom: '10%',
    top:'15%',
    containLabel: true
},
    xAxis: {
    type: 'category',
    name:'年龄',
    nameLocation:'end',
    nameTextStyle:{
    color:'#FFF',
        fontSize:14
},
    axisLabel:{
    color:'#FFF',
        fontSize:13
},
    boundaryGap: false,
    data:[ 0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22,
    23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45,
    46, 47, 48, 49, 50, 51, 52, 53, 54, 55, 56, 57, 58, 59, 60, 61, 62, 63, 64, 65, 66, 67, 68,
    69, 70, 71, 72, 73, 74, 75, 76, 77, 78, 79, 80, 81, 82, 83, 84, 85, 86, 87, 88, 89, 90, 91,
    92, 93, 94, 95, 96, 97, 98, 99, '100岁及以上']
},
    yAxis: {
    type: 'value',
    name:'女性比例(%)',
    nameLocation:'end',
    max:'100',
    nameTextStyle:{
    color:'#FFF',
        fontSize:14
},
    axisLabel:{
    color:'#FFF',
        fontSize: 13
},
},
    series: [
{
    data: [47.15, 47.24, 47.19, 47.29, 46.86, 46.56, 46.26, 46.16, 45.98, 45.82, 45.67,
    45.7, 45.88, 45.94, 46.29, 46.83, 46.67, 46.71, 47.63, 48.9, 48.98, 48.54, 47.61, 47.43, 47.65,
    47.53, 47.63, 47.48, 47.22, 47.03, 47.02, 47.14, 47.06, 46.81, 46.63, 46.17, 45.94, 45.81, 45.85,
    45.92, 45.94, 45.79, 46, 45.84, 45.76, 45.88, 45.88, 45.7, 45.79, 45.6, 46.11, 46.04, 46.33, 46.62,
    46.5, 47.15, 47.89, 47.85, 48.72, 50.27, 49.74, 48.91, 48.93, 49.73, 50.5, 50.41, 50.84, 51.08,
    50.8, 50.82, 50.09, 49.56, 50.11, 49.67, 49.95, 50.63, 50.51, 51.58, 51.75, 52.18, 51.81, 53.3,
    53.09, 53.6, 54.89, 56.16, 56.43, 55.69, 56.42, 55.25, 55.86, 57.43, 57.6, 57.95, 58.08, 58.29,
    59.35, 60.07, 59.23, 58.79, 59.68],
    type: 'line',
    areaStyle: {
    color:'#ee99d2',
},
    itemStyle: {
    color: "#E248AF"
},
    smooth:true,
    symbol:'circle',
    symbolSize:10,
    showSymbol:false
}
    ]
};
    myChart.setOption(option);